In [13]:
import pandas as pd

In [ ]:
df = pd.read_excel(r'C:\curso-eng-dados\Python-SGBDS\Origem de Dados\arquivos_excel\Produto.xlsx')
df.head()

In [ ]:
# df_calca = df.loc[df['name'] == 'Calça'] localizar 1 item especifico de uma coluna
df_calca = df.loc[df['Name'] == 'Calça']

In [ ]:
df_calca

In [ ]:
itens = ['Calça','TV','Perfume','Fogao']
df_itens = df.loc[df['Name'].isin(itens)]

In [ ]:
df_itens

In [ ]:
df2 = df.loc[df['Name'].isin(['Calça','TV','Perfume','Fogao'])]
df2

In [15]:
# localizar valor > que escolher
dfmais1000 = df.loc[df['Price'] > 1000]

In [16]:
dfmais1000.head()

    ID                  Name  Price  Id_Category
1    1  Bolsa mais que Velha   8000            0
10  10             Geladeira   1952            2
11  11                 Fogão   1373            2
12  12                    TV   1992            2
13  13      Máquina de Lavar   1826            2

In [17]:
df200a1000 = df.loc[(df['Price']> 200) & (df['Price']<= 1000)]

In [18]:
df200a1000.head()

    ID                 Name  Price  Id_Category
7    7      Hidratante caro    800            1
35  35           Video-Game    602            7
36  36  Máquina Fotográfica    377            7
37  37             Notebook    493            7
38  38                   PC    385            7